10/data/attachments/58298381882acddc.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Samantha_they_Friend_3080_1</nif:username>
            <nif:friendToBeRequested>soap_friends_93ff4070-cf5c-40b5-82d5-9452476aa2ca</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>